import {VoiceLanguagePack} from '../VoiceLanguagePack';

export const ukPack: VoiceLanguagePack = {
  language: 'uk',

  vocabulary: {
    control: {
      pauseWords: ['стоп', 'зупини', 'чекай'],

      resumeWords: ['продовж', 'далі', 'можна'],

      cancelWords: ['скасувати', 'завершити', 'закінчити'],

      stopKeywords: ['огляд'],

      stopVerbs: ['заверш', 'закінч', 'стоп', 'припини', 'верш'],
    },

    flow: {
      inspectionWords: ['огляд'],

      feedingWords: ['годівл'],
    },

    domain: {
      intents: {
        SWARM: [
          'рій',
          'роїння',
          'роїться',
          'маточн',
          'маточник',
          'маточники',
          'рі',
          'мат',
        ],

        SPLIT: [
          'відводок',
          'відводки',
          'відвод',
          'відводу',
          'розділив',
          'відводи',
          'вод',
        ],

        DISEASE: [
          'хвороб',
          'проблем',
          'вароа',
          'варооз',
          'кліщ',
          'понос',
          'пронос',
          'крила',
          'деформ',
          'слабкий розплід',
          'дірявий розплід',
        ],

        FEEDING: [
          'корм',
          'кормити',
          'підгод',
          'підкорм',
          'сироп',
          'цукор',
          'кормлю',
          'кормлення',
          'годівля',
          'годувати',
          'годування',
          'годую',
          'годуй',
        ],
      },
    },

    numbers: {
      cardinal: {},

      keywords: {
        thousand: ['тисяча', 'тисячі', 'тисяч'],
      },
    },
  },
};
